package Homework1;

/**
 * Создать при помощи обычного вывода картинку дома при помощи String output = "_________/...\n" и т.л.(Используйте спецсимволы).
 */

public class Task1 {

    public static void main (String[] args) {

        String house = "____________\'\"___\n" +
                "___________---___\n" +
                "________/\\_|_|___\n" +
                "_______/__\\|_|___\n" +
                "______/____\\_|___\n" +
                "_____/______\\|___\n" +
                "____/__[__]__\\___\n" +
                "___/|________|\\__\n" +
                "__/_|________|_\\_\n" +
                "____|________|____\n" +
                "____|__---___|____\n" +
                "____|__| |___|____";
        System.out.printf(house);
    }
}
